app/controllers/reservations_controller.rb

  def create
    @restaurant = Restaurant.find(params[:restaurant_id])
    @reservation = Reservation.new(params[:restaurant])
    if @reservation.save
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", "22"]]
INSERT INTO "reservations" ("created_at", "restaurant_id", "size", "time", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 04 Jul 2013 18:02:39 UTC +00:00], ["restaurant_id", nil], ["size", nil], ["time", nil], ["updated_at", Thu, 04 Jul 2013 18:02:39 UTC +00:00], ["user_id", nil]]