app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("address", "category_id", "created_at", "menu", "name", "neighborhood", "num_seats", "price_range", "summary", "timeslots_available", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @restaurant = Restaurant.new(params[:restaurant])

    respond_to do |format|
      if @restaurant.save

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", "8"]]
UPDATE "restaurants" SET "summary" = 'yxcbvfyb öalkjsdf', "updated_at" = '2013-07-13 14:49:36.297662' WHERE "restaurants"."id" = 8
---
  def update
    @restaurant = Restaurant.find(params[:id])

    respond_to do |format|
      if @restaurant.update_attributes(params[:restaurant])