app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT 1
---
  def create
    @user = User.find(params[:email])