app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password_digest", "points", "remember_token", "role", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    @user.points = 0
    if @user.save